Revit 2026 API
FabricSheet.GetBendProfile Method
 Returns the profile (not including generated fillets) that defines the shape of the Fabric Sheet bending.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public CurveLoop GetBendProfile()
Public Function GetBendProfile As CurveLoop
public:
CurveLoop^ GetBendProfile()
member GetBendProfile : unit -> CurveLoop
Return Value
CurveLoop
 The profile that defines the shape of the fabric sheet bending for bent fabric sheet, for flat fabric sheet null will be returned.
Remarks
 The returned profile defines the center-curve of a wire. Note that bent Fabric Sheets can have planar geometry, but flat Fabric Sheets are always planar.
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace